Repository: Raphael-Mssn/wishlist
Catalog: wishlist/lib/l10n/arb/app_*.arb
Languages: fr

# appTitle
source: Wishlist
fr: Wishy

# validEmailError
source: Please enter a valid email address
fr: Veuillez saisir une adresse e-mail valide

# passwordField
source: Password
fr: Mot de passe

# passwordLengthError
source: Password must be at least 6 characters
fr: Le mot de passe doit contenir au moins 6 caractères

source: Sign in
fr: Se connecter

source: Sign up
fr: S'inscrire

# dontHaveAccount
source: Don't have an account ? Create one !
fr: Vous n'avez pas de compte ? Créez-en un !

# haveAccount
source: Already have an account ? Sign in !
fr: Vous avez déjà un compte ? Connectez-vous !

source: Invalid login credentials
fr: Identifiants de connexion invalides

# userAlreadyRegistered
source: This email is already registered
fr: Cet email est déjà enregistré

# genericError
source: An error occurred, please try again
fr: Une erreur est survenue, veuillez réessayer.

# validPseudoError
source: Pseudo cannot be empty
fr: Le pseudo ne peut pas être vide

# pseudoAlreadyExists
source: This pseudo is already used
fr: Ce pseudo est déjà utilisé

# savePseudo
source: Save
fr: Sauvegarder

# settingsScreenTitle
source: Settings
fr: Paramètres

# settingsScreenEmailModify
source: Modify
fr: Modifier

# settingsScreenDisconnect
source: Disconnect
fr: Se déconnecter

# settingsScreenDisconnectDialogTitle
source: Disconnect
fr: Se déconnecter

# settingsScreenDisconnectDialogExplanation
source: Are you sure you want to disconnect ?
fr: Es-tu sûr de vouloir te déconnecter ?

# settingsScreenPasswordModify
source: Change my password
fr: Modifier mon mot de passe

# settingsScreenPseudoModify
source: Change my pseudo
fr: Modifier mon pseudo

# changePasswordScreenTitle
source: Password
fr: Mot de passe

# oldPasswordField
source: Old password
fr: Ancien mot de passe

# newPasswordField
source: New password
fr: Nouveau mot de passe

# confirmNewPasswordField
source: Confirm new password
fr: Confirmer le nouveau mot de passe

source: Passwords do not match
fr: Les mots de passe ne correspondent pas

# oldPasswordIncorrect
source: Incorrect old password
fr: Ancien mot de passe incorrect.

# changePasswordConfirm
source: Change
fr: Modifier

# newPasswordShouldBeDifferent
source: New password should be different from the old one
fr: Le nouveau mot de passe doit être différent de l'ancien.

# newPseudoField
source: New pseudo
fr: Nouveau pseudo

# changePseudoConfirm
source: Change
fr: Modifier

# changePseudoSuccess
source: Pseudo changed successfully
fr: Pseudo modifié avec succès !

# settingsScreenDeleteAccount
source: Delete my account
fr: Supprimer mon compte

source: No wishlist
fr: Aucune wishlist

# createButton
source: Create
fr: Créer

# createWishlist
source: Create a wishlist
fr: Créer une wishlist

source: Name
fr: Nom

# cancelButton
source: Cancel
fr: Annuler

# closeDialog
source: Dismiss the contextual window
fr: Fermer la fenêtre contextuelle

# fiendsScreenTitle
source: Friends
fr: Amis

source: No friend
fr: Aucun ami

# addButton
source: Add
fr: Ajouter

# emailOrPseudoHint
source: Email or pseudo
fr: Email ou pseudo

source: No user found
fr: Aucun utilisateur trouvé

# friendDetailsRemove
source: Remove
fr: Supprimer

# removeFriendConfirmation
source: Are you sure you want to remove this friend?
fr: Es-tu sûr de vouloir supprimer cet ami ?

# removeFriendSuccess
source: Friend removed successfully
fr: Ami supprimé avec succès !

# friendDetailsMutualFriendsTitle
source: Mutual friends
fr: Amis en commun

# friendDetailsNoMutualFriends
source: No mutual friends
fr: Aucun ami en commun

# friendDetailsWishlistsTitle
source: Public wishlists
fr: Wishlists publiques

source: My wishlists
fr: Mes wishlists

# wishlistStatusPending
source: Pending
fr: En attente

# wishlistStatusBooked
source: Booked
fr: Réservés

# wishlistSearchHint
source: Search for a wish...
fr: Rechercher un wish...

# wishlistNoWish
source: No wish
fr: Aucun wish

# wishlistNoWishBooked
source: No wish booked
fr: Aucun wish réservé

# wishlistNoWishBookedDisplayed
source: You chose not to display booked wishes
fr: Tu as choisi de ne pas afficher les wishs réservés

# wishlistAddWish
source: Add a wish
fr: Ajouter un wish

# createWishBottomSheetTitle
source: Create a wish
fr: Créer un wish

# createWishSuccess
source: Wish created successfully
fr: Wish créé avec succès !

# editWishBottomSheetTitle
source: Edit a wish
fr: Modifier un wish

source: Delete wish
fr: Supprimer le wish

# deleteWishConfirmationMessage
source: Are you sure you want to delete this wish?
fr: Es-tu sûr de vouloir supprimer ce wish ?

# deleteWishSuccess
source: Wish deleted successfully
fr: Wish supprimé avec succès !

# editButton
source: Edit
fr: Modifier

# wishNameLabel
source: Name
fr: Nom

# wishPriceLabel
source: Price
fr: Prix

# wishQuantityLabel
source: Quantity
fr: Quantité

# wishLinkLabel
source: Link
fr: Lien

# wishImageLabel
source: Wish image
fr: Image du wish

source: Upload Image
fr: Ajouter une image

# wishNameError
source: Wish name is required
fr: Le nom du wish est requis

# notNullError
source: This field is required
fr: Ce champ est requis

source: Invalid number
fr: Nombre invalide

# numberRangeError
source: Enter a number between {min} and {max}
fr: Saisis un nombre entre {min} et {max}

source: Open link
fr: Ouvrir le lien

# linkNotValid
source: The link is not valid
fr: Le lien n'est pas valide !

source: I want to give it
fr: Je veux l'offrir

source: Cancel booking
fr: Annuler la réservation

source: Wishlist visibility
fr: Visibilité de la wishlist

source: Private
fr: Privée

source: Public
fr: Publique

# seeTakenWishs
source: See taken wishes
fr: Voir les wishs réservés

source: Yes
fr: Oui

source: No
fr: Non

source: Wishlist shared with
fr: Wishlist partagée avec

# addCollaborator
source: Add a collaborator
fr: Ajouter un collaborateur

source: Save
fr: Enregistrer

# updateSuccess
source: Update successfully completed
fr: Mise à jour effectuée avec succès !

# deleteWishlist
source: Delete my wishlist
fr: Supprimer ma wishlist

# deleteWishlistConfirmation
source: Are you sure you want to delete this wishlist?
fr: Es-tu sûr de vouloir supprimer cette wishlist ?

# deleteWishlistWishesWarning
source: Wishes will also be deleted.
fr: Les wishs seront également supprimés.

# deleteWishlistSuccess
source: Wishlist successfully deleted
fr: Wishlist supprimée avec succès !

source: Wishlist color
fr: Couleur de la wishlist

# sortWishs
source: Sort wishes
fr: Trier les wishs

# sortByFavorite
source: By favorites
fr: Par favoris

# sortByAlphabetical
source: By alphabetical order
fr: Par ordre alphabétique

# sortByPrice
source: By price
fr: Par prix

# sortByDate
source: By creation date
fr: Par date de création

# selectQuantityToGive
source: How much would you like to offer?
fr: Quelle quantité souhaites-tu offrir ?

# wishReservedSuccess
source: Wish reserved successfully!
fr: Wish réservé avec succès !

# quantityCannotBeLowerThanBooked
source: Quantity cannot be lower than {bookedQuantity} (already booked quantity)
fr: La quantité ne peut pas être inférieure à {bookedQuantity} (quantité déjà réservée)

# avatarOptions
source: Avatar modification
fr: Modification de l'avatar

source: Choose from gallery
fr: Choisir depuis la galerie

# takePhoto
source: Take a photo
fr: Prendre une photo

# imageOptions
source: Image upload
fr: Ajout de l'image

source: Remove image
fr: Supprimer l'image

# removeImageConfirmation
source: Are you sure you want to remove this image?
fr: Es-tu sûr de vouloir supprimer cette image ?

# avatarLoadError
source: Error loading image
fr: Erreur lors du chargement de l'image

# forgotPasswordButton
source: Forgot password?
fr: Mot de passe oublié ?

# forgotPasswordTitle
source: Forgot password
fr: Mot de passe oublié

# forgotPasswordDescription
source: Please enter your email address to receive the password reset link.
fr: Veuillez saisir votre adresse e-mail afin de recevoir le lien de réinitialisation de votre mot de passe.

# forgotPasswordSendButton
source: Send
fr: Envoyer

# forgotPasswordEmailSent
source: A password reset email has been sent!
fr: Un e-mail de réinitialisation a été envoyé !

# resetPasswordTitle
source: Reset password
fr: Réinitialiser le mot de passe

# resetPasswordDescription
source: Enter your new password.
fr: Saisissez votre nouveau mot de passe.

# resetPasswordConfirm
source: Reset
fr: Réinitialiser

# resetPasswordSuccess
source: Password reset successfully! Please sign in with your new password.
fr: Mot de passe réinitialisé avec succès ! Reconnectez-vous avec votre nouveau mot de passe.

# resetPasswordLinkExpired
source: The reset link has expired. Please request a new one.
fr: Le lien de réinitialisation a expiré. Veuillez en demander un nouveau.
